app/Models/AuthModel.php

	public function getCountryAndPostList()
	{

		$query = $this->db->table('products')
			->select('product_id, product_name')
			->get();
		$result['category'] = $query->getResult();

		$query = $this->db->table('countries')
			->select('id, name')
			->get();
---
SELECT `product_id`, `product_name`
FROM `products`
SELECT `id`, `name`
FROM `countries`