app/Models/Client_ChatModel.php

    public function getChatHistory($client_id, $user_id, $post_id)
    {
        $builder = $this->db->table('chat');
        $builder->select('cw_post_id, send_by, send_to, message, created_date');
        $builder->where('cw_post_id', $post_id);
        $builder->groupStart();
        $builder->where('send_by', $client_id);
        $builder->orWhere('send_by', $user_id);
        $builder->orWhere('send_to', $client_id);
        $builder->orWhere('send_to', $user_id);
        $builder->groupEnd();
        $query = $builder->get();
---
SELECT `cw_post_id`, `send_by`, `send_to`, `message`, `created_date`
FROM `chat`
WHERE `cw_post_id` = '2'
AND   (
`send_by` = '4'
OR `send_by` = '2'
OR `send_to` = '4'
OR `send_to` = '2'
 )