app/Models/Client_Management.php

SELECT `id`, `first_name`, `last_name`, `user_email`, `user_status`, `user_contact`
FROM `user_master`
WHERE `id` = '4'
SELECT `user_products_ids`
FROM `user_profile`
WHERE `user_id` = '4'
SELECT `product_id`, `product_name`
FROM `products`
WHERE `product_id` = '3'
---
    public function getClientById($id)
    {


        $query = $this->db->table('user_master')
            ->select('id, first_name, last_name, user_email, user_status, user_contact')
            ->where('id', $id)
            ->get();

        $users = $query->getResult();

        $allproducts_query = $this->db->table('user_profile')
            ->select('user_products_ids')
            ->where('user_id', $users[0]->id)
            ->get();

        $all_products = $allproducts_query->getResult();

        $product_ids = explode('#', $all_products[0]->user_products_ids);
        foreach ($product_ids as $key => $product_id) {
            $products_query = $this->db->table('products')
                ->select('product_id, product_name')
                ->where('product_id', $product_id)
                ->get();