app/Models/Client_Post_Model.php

    public function getPostBySlug($id)
    {
        $query = $this->db->table('cw_posts')
            ->select('_id, product_id, post_title, post_content, post_slug, post_status, post_image')
            ->where('post_slug', $id)
            ->get();
---
SELECT `_id`, `product_id`, `post_title`, `post_content`, `post_slug`, `post_status`
FROM `cw_posts`
WHERE `post_status` = '1'