app/Models/Client_RM_Model.php

SELECT `id`, `first_name`, `last_name`, `user_email`, `user_status`
FROM `user_master`
WHERE `id` = '2'
SELECT `user_products_ids`
FROM `user_profile`
WHERE `user_id` = '2'
SELECT `product_id`, `product_name`
FROM `products`
WHERE `product_id` = '3'
---
    public function getRmDetails($id)
    {

        $query = $this->db->table('user_master')
            ->select('id, first_name, last_name, user_email, user_status')
            ->where('id', $id)
            ->get();

        $users = $query->getResult();

        foreach ($users as $user) {
            $user_allProductIds_query = $this->db->table('user_profile')
                ->select('user_products_ids')
                ->where('user_id', $user->id)
                ->get();

            $user_allProductIds = $user_allProductIds_query->getResult();

            $productIds_list = explode('#', $user_allProductIds[0]->user_products_ids);

            foreach ($productIds_list as $key => $productId) {
                $getProducts_query = $this->db->table('products')
                    ->select('product_id, product_name')
                    ->where('product_id', $productId)
                    ->get();