app/Models/Posts_Management.php

SELECT `_id`, `product_id`, `post_title`, `post_content`, `post_slug`, `post_region`, `min_purchase_amount`, `max_purchase_amount`, `post_status`, `post_image`
FROM `cw_posts`
WHERE `post_slug` = 'intrade'
SELECT `product_name`
FROM `products`
WHERE `product_id` = '3'
---
    public function getPostBySlug($id)
    {


        $query = $this->db->table('cw_posts')
            ->select('_id, product_id, post_title, post_content, post_slug, post_region, min_purchase_amount, max_purchase_amount, post_status, post_image')
            ->where('post_slug', $id)
            ->get();

        $post = $query->getResult();

        $products_query = $this->db->table('products')
            ->select('product_name')
            ->where('product_id', $post[0]->product_id)
            ->get();